Autodesk.Revit.UI.RibbonButton.IsEnabledByContext
Indicates if this button can be executed. True if the pushbutton is permitted to be executed based on the
current Revit context (active document, active view and active tool). False if the pushbutton is disabled because
of the active context.
Remarks: The button may be enabled for a given context but still disabled programmatically using the Enabled property
for the button.

Autodesk.Revit.UI.RibbonButton.Image
The image of the button.
Remarks: The image will be shown on the button if it is a part of a stacked set or if it is promoted to the
Quick Access Toolbar. The image should be 16 x 16 pixels. If the image is larger it will NOT be adjusted to fit the
button.

Autodesk.Revit.UI.RibbonButton.LargeImage
The large image shown on the button.
Remarks: The image will be shown on the button in the Ribbon panel if the button is not a part of a stacked set.
It will also be shown if the button is added to a pulldown button. The image should be 32 x 32 pixels. If the image is larger
it will be adjusted to fit the button.

Autodesk.Revit.UI.RibbonButton
This class is the base class of PushButton and PulldownButton.